{
  "personal": {
    "name": "Alae Laaziri",
    "title": "Software & Automation Engineer",
    "location": "New York, NY",
    "email": "alaelaaziri555@gmail.com",
    "website": "alaeportfolio.com",
    "github": "github.com/LaazAlae",
    "linkedin": "linkedin.com/in/alae-laaziri/",
    "phone": "646-251-8065",
    "status": "Authorized to work in the U.S. through 2028 (renewable) · No sponsorship required"
  },
  "about": {
    "description": "Recent CS Graduate and incoming Graduate Student at **Johns Hopkins University** (MS in Cybersecurity). I am a precision-focused Software Engineer specializing in building high-assurance **distributed systems**, automating complex enterprise workflows, and crafting **secure digital infrastructure**. My work bridges the gap between theoretical security models and production-grade software solutions.",
    "stats": [
      { "label": "Cybersecurity", "value": "Incoming M.S." },
      { "label": "Projects Shipped", "value": "12+" },
      { "label": "Full Stack", "value": "Expert" }
    ]
  },
  "skills": {
    "Core Programming": ["Python", "JavaScript", "Go", "Java", "C", "SQL", "HTML/CSS", "TypeScript"],
    "Web Frameworks": ["React", "Express.js", "Flask", "Node.js", "Socket.IO", "Tailwind CSS", "Material-UI"],
    "Infrastructure": ["Docker", "Nginx", "MongoDB", "PostgreSQL", "Git", "Railway", "Digital Ocean", "Firebase", "SQLite"],
    "Security & Systems": ["OAuth", "JWT", "AES-256", "Distributed Systems", "Consensus Algorithms", "Network Programming", "Security Engineering"],
    "Languages": ["English", "French", "Arabic"]
  },
  "experience": [
    {
      "company": "United Corporate Services Inc.",
      "title": "Software & Automation Engineer",
      "period": "June 2024 – Present",
      "location": "White Plains, NY",
      "description": [
        "Architected the AlaeAutomates platform, reducing manual document processing time by 99% through intelligent **PDF parsing** and fuzzy matching algorithms.",
        "Engineered secure automated payment workflows enabling seamless reconciliation between credit card processors and check systems.",
        "Designed a company-wide **SharePoint** architecture to modernize digital collaboration and secure document retention.",
        "Developed custom **Excel automation** tools with complex heuristic matching for financial data reconciliation."
      ]
    }
  ],
  "education": [
    {
        "institution": "Johns Hopkins University",
        "degree": "Master of Science in Cybersecurity",
        "period": "Starting Jan 2026",
        "details": "Whiting School of Engineering",
        "highlight": true
    },
    {
        "institution": "University at Buffalo – SUNY",
        "degree": "Bachelor of Science in Computer Science",
        "period": "Aug 2021 – May 2025",
        "details": "Dean's List: Fall 2021, Spring 2025",
        "coursework": ["Machine Learning", "Distributed Systems", "Software Security", "Applied HCI", "Algorithms"]
    }
  ],
  "projects": [
    {
      "id": "alae-automates",
      "title": "AlaeAutomates",
      "shortDescription": "Automated financial reconciliation suite reducing manual processing time by 99% (8 hours → 5 minutes).",
      "longDescription": "Designed and deployed a mission-critical automation suite for United Corporate Services, directly addressing a bottleneck where staff spent entire workdays manually reconciling 1,000+ page financial batches. By automating PDF parsing and fuzzy logic matching, this tool transformed a manual 8-hour task into a 5-minute automated background process, effectively liberating ~20% of the department's weekly bandwidth for higher-value work.\n\n**Technical Architecture:**\nThe system is architected as a decoupled application with a heavy-duty **Flask** (Python) computational backend and a reactive **Express.js** frontend. It integrates **PyMuPDF** for high-fidelity data extraction from unstructured invoice PDFs, which are then processed through custom heuristic algorithms to match against bank records with 99.9% accuracy. The architecture implements strict **ACID compliance** via **SQLite** for transaction integrity and features file-locking mechanisms to safely handle concurrent batch processing in a multi-user environment.",
      "technologies": ["Python", "Flask", "Express.js", "SQLite", "Heuristic Algorithms", "PDF Parsing", "Railway"],
      "links": {
        "demo": "https://alaeautomates.up.railway.app/",
        "github": "https://github.com/LaazAlae/AlaeAutomates2.0"
      }
    },
    {
      "id": "distributed-systems",
      "title": "DistributedSystems",
      "shortDescription": "High-assurance implementation of Raft Consensus and MapReduce resilient to severe network partitions.",
      "longDescription": "A production-grade implementation of core distributed systems protocols designed to guarantee data consistency in unreliable networks. This project serves as a rigorous proof-of-concept for building systems that can survive node crashes and message drops without data loss. It passes the strict MIT 6.824 correctness tests, verifying its ability to handle split-brain scenarios and leader failures autonomously.\n\n**Technical Architecture:**\nWritten entirely in **Go**, this suite features a custom **RPC** layer facilitating communication between concurrent goroutines. The **Raft** consensus module implements leader election, log replication, and persistence, using non-blocking channels to handle asynchronous heartbeats and commit indexes. The **MapReduce** framework leverages worker-coordinator architecture with fault-recovery logic—if a worker hangs or crashes, the coordinator reassigns tasks in real-time, ensuring job completion regardless of individual node health.",
      "technologies": ["Go", "Distributed Systems", "Raft Consensus", "MapReduce", "RPC", "Concurrency", "Fault Tolerance"],
      "links": {
        "demo": "",
        "github": ""
      }
    },
    {
      "id": "friends-go-together",
      "title": "FriendsGoTogether",
      "shortDescription": "Real-time logistics platform optimizing transportation for university students with geospatial routing.",
      "longDescription": "A dedicated transportation network solving the 'empty seat' problem for university transit. The platform connects students with compatible travel plans, enhancing campus mobility and safety. It supports a validated database of over **19,000 cities**, enabling precise route matching and effectively functioning as a niche, high-trust version of Uber for the academic community.\n\n**Technical Architecture:**\nThe platform runs on a scalable **Dockerized** microservices architecture. The backend, built with **Flask**, utilizes **MongoDB** for flexible schema management of dynamic user profiles and trip metadata. A key technical feature is the **Geospatial Data Engine**, which performs fuzzy matching and coordinate validation to normalize user input against a massive global city dataset. Real-time updates are pushed via **Socket.IO**, creating a bi-directional event loop that syncs ride status instantly across clients without polling.",
      "technologies": ["Python", "Flask", "MongoDB", "Socket.IO", "Docker", "Nginx", "Geospatial Indexing", "OAuth"],
      "links": {
        "demo": "https://friendsgotogether.com",
        "github": "https://github.com/LaazAlae/ShiftSpace"
      }
    },
    {
      "id": "expense-tracker",
      "title": "ExpenseTracker",
      "shortDescription": "Enterprise-grade financial tracking system engineered for auditability and data security.",
      "longDescription": "A financial oversight tool built to simulate banking-grade security standards. Unlike standard expense trackers, this system prioritizes the 'chain of custody' for every transaction, providing an immutable audit trail for administrators. It is designed to prevent fraud and unauthorized access in sensitive financial environments.\n\n**Technical Architecture:**\nSecurity is baked into the core using **Security Engineering** principles. Sensitive columns in the **PostgreSQL** database are encrypted at rest using **AES-256**. The application layer, powered by **Node.js**, implements strict **Role-Based Access Control (RBAC)** and IP-address logging for every session. Real-time fraud detection alerts are broadcasted to admin dashboards via **Socket.IO**, allowing for immediate reaction to suspicious account activity.",
      "technologies": ["Node.js", "PostgreSQL", "AES-256 Encryption", "Socket.IO", "React", "Security Engineering", "RBAC"],
      "links": {
        "demo": "https://expensetracking.up.railway.app/",
        "github": "https://github.com/LaazAlae/expenseTracker"
      }
    },
    {
      "id": "smart-laundry",
      "title": "LaundryMinutes",
      "shortDescription": "IoT-enabled laundry management PWA with NFC integration.",
      "longDescription": "A modern IoT solution replacing antiquated coin-op laundry systems with digital, contactless interactions. This Progressive Web App (PWA) streamlines the scheduling of shared physical resources, reducing user friction and machine downtime through intelligent queue management and instant status visibility.\n\n**Technical Architecture:**\nThe system bridges the physical and digital worlds using the **Web NFC API**, allowing the web app to interact directly with hardware tags. The state of the physical machines is synchronized in soft real-time across all clients using **Firebase Realtime Database**. The backend architecture is designed for resilience, utilizing **Service Workers** to cache app shell assets, ensuring the control interface remains loadable even in university basements with poor network connectivity.",
      "technologies": ["Node.js", "IoT", "Web NFC API", "Firebase", "PWA", "Service Workers"],
      "links": {
        "demo": "https://modernlaundry.onrender.com/",
        "github": "https://github.com/LaazAlae/modernlaundry"
      }
    },
    {
      "id": "doc-automation",
      "title": "DocFiller",
      "shortDescription": "Desktop automation tool enforcing strict compliance for complex shipping documentation.",
      "longDescription": "A specialized desktop utility built to eliminate human error in high-stakes shipping workflows. In logistics, a single typo on a critical form can result in massive delays or fines. This tool enforces rigid validation constraints, ensuring that generated documentation is 100% compliant with standards before it ever hits the printer.\n\n**Technical Architecture:**\nBuilt as a standalone executable using **Python** and **Kivy**, this application runs locally to ensure data privacy. It features a custom **Templating Engine** that maps validated user input onto PDF/Docx forms with pixel-perfect precision. The logic layer implements a complex state machine to guide users through the dependency-heavy form filling process, preventing invalid combinations of data.",
      "technologies": ["Python", "Kivy", "PyInstaller", "Desktop Automation", "Compliance Logic"],
      "links": {
        "demo": "",
        "github": "https://github.com/LaazAlae/doc-filler"
      }
    },
    {
      "id": "fabulous-social",
      "title": "Naturest",
      "shortDescription": "Scalable social network engineered for high-concurrency user interactions and media sharing.",
      "longDescription": "A robust social platform built to handle the complexity of many-to-many user relationships. The project focuses on the scalability of social interactions—feeds, likes, comments, and follows—ensuring a snappy user experience even as the complexity of the social graph grows. It demonstrates the ability to ship a feature-complete product using Agile sprints.\n\n**Technical Architecture:**\nThe frontend leverages **React 18** concurrency features and **TypeScript** for type-safe, maintainable component logic. State management is optimized to minimize re-renders during high-frequency updates (like live like-counts). The backend implements a RESTful API design with optimized SQL queries to efficiently traverse the social graph (e.g., 'fetching posts from users I follow'), avoiding the N+1 query problem common in social applications.",
      "technologies": ["React", "TypeScript", "Material-UI", "Socket.IO", "SQL Optimization", "Agile"],
      "links": {
        "demo": "https://webdev.cse.buffalo.edu/hci/teams/fabulous/welcome",
        "github": "https://github.com/CSE370HCI/fabulous"
      }
    },
    {
      "id": "custom-server",
      "title": "NoframeworkApp",
      "shortDescription": "Zero-dependency web server implemented from scratch using raw TCP/IP sockets.",
      "longDescription": "An infrastructure-level project built to deconstruct the magic of modern web servers. By rejecting all external HTTP libraries, this server handles raw byte streams directly from the network card. It serves as a demonstration of deep networking knowledge, specifically handling the OSI Model's Transport and Application layers manually.\n\n**Technical Architecture:**\nWritten in **Python**, the server creates a raw **TCP Socket** bound to a port, listening for incoming packet streams. It implements a custom **HTTP Parser** that decodes headers, verbs (GET, POST), and payloads according to **RFC 7230**. It also includes a hand-written **WebSocket Handshake** mechanism (RFC 6455), manually computing the Sec-WebSocket-Accept hash to upgrade connections, proving a fundamental understanding of full-duplex communication protocols.",
      "technologies": ["Python", "TCP/IP Sockets", "HTTP/1.1 Specification", "WebSockets", "Low-Level Networking"],
      "links": {
        "demo": "",
        "github": ""
      }
    },
    {
      "id": "budget-db",
      "title": "FederalBudgetDB",
      "shortDescription": "Normalized relational database engine for analyzing complex US Treasury datasets.",
      "longDescription": "A data engineering project focused on transforming messy, real-world government datasets into a pristine, queryable analytical engine. The system ingests 5+ years of US Treasury data, cleaning and restructuring it to expose hidden trends in federal spending. It prioritizes data integrity and query performance over simple storage.\n\n**Technical Architecture:**\nThe schema is rigorously designed to **Boyce-Codd Normal Form (BCNF)**, eliminating data redundancy and update anomalies. The system utilizes **PostgreSQL** advanced features, including **Stored Procedures** and **Triggers**, to automatically validate data quality during the ingestion pipeline (ETL). Complex reporting is handled via optimized Window Functions and Common Table Expressions (CTEs), allowing for performant aggregation of millions of transaction rows.",
      "technologies": ["PostgreSQL", "Database Normalization (BCNF)", "ETL Pipelines", "PL/pgSQL", "Data Warehousing"],
      "links": {
        "demo": "",
        "github": ""
      }
    }
  ]
}